# TC1002S.201 - Equipo 3
# Actividad Evaluable 2: Básicos R
# Jesús Ángel Guzmán Ortega A01799257
# Julio Cesar Vivas Medina A01749879


# Problema 1 --------------------------------------------------------------

x <- 10 # readline("Ingresa valor x: ")
y <- 100 # readline("Ingresa valor y: ")
z <- x+y
z

# Problema 2 --------------------------------------------------------------

l <- 5
a <- l**2
a


# Problema 3 --------------------------------------------------------------

b <- 8
h <- 4
aT <- (b*h)/2
aT

# Problema 4 --------------------------------------------------------------

rad <- 10
aC <- pi*rad**2

# Problema 5 --------------------------------------------------------------

radC <- 7.5
h <- 5
v <- 1/3*pi*radC**2*h
v


# Problema 6 --------------------------------------------------------------

pesos <- 100
dolar <- pesos/20
dolar

# Problema 7 --------------------------------------------------------------

gF <- 100
gC <- 5/9*gF-32
sprintf("%.2f",gC)
